{
  "id": "mjpwsahj-5h59c6",
  "title": "2025 Letter from The Founders",
  "braindump": "So I want to share some ideas around an annual letter from the CEO for Pillar that I can draft and create on LinkedIn. Basically, I want to recap some of the progress that we've made over the course of 2025 and where we see ourselves going in 2026, as well as some commentary on the industry. I think in 2025, we really spent a lot of the year continuing to define and refine the foundation of our business. So if we look at previous years in 2024 as just throwing things at the wall and trying to find what sticks, I would say this is a year where we started to dial in on a pattern of what we were noticing that was sticking. We did our first year where we crossed six figures in annual revenue, which was a big win for us as a two-person team. Our goal going into 2026 is to continue scaling that and get ourselves to free cash flow profitability or a higher degree of free cash flow profitability. Whereas today, we're basically around profitable. We just crossed around $120,000 in revenue. And I think really what we see ourselves doing is now that we've validated some ideas and needs around site selection and land acquisition workflows between the need for JS functionality and CRM. We mostly validated that with enterprise clients leading up until this point. Now, we've started to lay the foundation for a broader platform that we can democratize and give larger access to in more of a self-service way. So we see ourselves offering more affordable price tiers, which we've already started to do and seen some very strong initial success with over the last couple of months. Growing our user base and working with many, many more people and building more and more functionality to help people with the workflow of finding land, contacting owners, and winning and managing deals is really the goal inside of our platform that we see becoming more and more robust. And we've concentrated a lot on residential leading up until this point. We've already started to make some inroads and see ourselves making some large announcements in the retail space and potentially others as we continue to expand the capabilities of our platform and product. Really, I think what we have began to understand at this stage through the course of 2025 is that we are a geospatial company. We are a workflow company, and the competitive edge that we create in the space is extreme capital efficiency as a two-person team and always choosing to be creative and find ways to be resourceful rather than shelling out capital to achieve features that our customers need. And I think we see that trend continuing. We've had immense tailwinds from our productivity and our capacity, from the increasing improvement of large language models for code generation, and that the current state of our product is a testament to that fact. It's something that would have cost millions if not tens of millions of dollars to build pre-LLMs in the 2022-2023 period. And now as a two-person team, basically with persistence and hard work, we've been able to bring our platform to a really remarkable place, and we only see that trend continuing going forward. So I think really our greatest challenges right now that we've seen is just simple brand awareness. We need more people to be aware of us and what we do and why they should choose to use us. And so I think that people should expect to hear much more from us and that we're going to be investing more into ways to be putting our brand and our name out there on a day-to-day basis, sharing more about the story of who we are and who we're helping and why we are the best at what we do. So I think you'll be seeing more content from that. We'll be publishing more resources to demonstrate through showing, not telling, around how we're producing top-quality work, how we're operating ourselves like a next-generation team and remaining at the bleeding edge, competing with teams that are much larger than us by a factor of 10 or 100, much better capitalized than us by factors of tens and hundreds. And I think we see no reason why we cannot be number one in the industry despite those setbacks. I think that we see tremendous advantage in being nimble, being closer to the customer, which is what we do. And those are all the things that I think people can come to expect in 2026 as we sink ourselves deeper into becoming an industry leader in terms of offering geospatial solutions that are accessible, intuitive, and easy to use that are connected to the real estate and built world.",
  "notes": "# 🧭 An Annual Letter from the CEO of Pillar  \n### *Reflecting on 2025, Looking Ahead to 2026*\n\n> *Experimentation → Validation → Platformization → Scale*  \n>  \n> That was the arc of 2025.\n\n---\n\n## 2025 Was a Defining Year\n\n2025 was a defining year for Pillar.\n\nIf **2024** was about exploration—throwing ideas at the wall and learning quickly—**2025** was about **pattern recognition**.  \nIt was the year we began to understand what actually sticks, where real value lives, and how we want to build this company long term.\n\n---\n\n### 📈 A Concrete Milestone\n\n> **For the first time, Pillar crossed six figures in annual revenue.**\n\nWe closed the year at roughly **$120,000 in revenue** as a **two-person team**.\n\nThat milestone matters not because of the number itself, but because it validated something more important:\n\n- We are solving **real problems**\n- For **real customers**\n- In a **sustainable way**\n\nAs we head into 2026, our goal is simple and disciplined:\n\n> **Scale responsibly toward stronger free-cash-flow profitability  \n> while expanding access to what we’ve built.**\n\n---\n\n## What We Learned in 2025\n\nOver the past year, we validated something critical:\n\n> **Pillar is not just a site-selection tool.  \n> We are a geospatial company *and* a workflow company.**\n\nOur customers don’t just need maps or data.  \nThey need **systems** that help them:\n\n- Find land more intelligently  \n- Understand constraints faster  \n- Contact owners efficiently  \n- Manage deal flow end-to-end  \n\n---\n\n### 🧩 From Enterprise Validation to Platform Thinking\n\nHistorically, we focused heavily on **enterprise customers** to validate these workflows.\n\nThat work gave us confidence in:\n- the underlying architecture  \n- the durability of the workflows  \n- the problems worth solving  \n\nIn 2025, we began laying the foundation for something broader.\n\n> **This platform should be democratized, not gated.**\n\nThat shift is already underway:\n- More affordable pricing tiers  \n- A move toward self-service  \n- A wider range of users and use cases  \n\nThe response over the past few months reinforced our belief that this direction is correct.\n\n---\n\n## Capital Efficiency as a Competitive Advantage\n\nOne of the clearest realizations this year:\n\n> **Our edge isn’t headcount.  \n> It’s capital efficiency.**\n\nAs a two-person team, we’ve chosen:\n- creativity over brute force  \n- discipline over sprawl  \n- proximity to customers over scale theater  \n\nThe rapid improvement of large language models amplified this advantage dramatically.\n\n```text\nFeatures that once cost millions\n→ now require persistence, iteration,\n  and disciplined execution.",
  "createdAt": "2025-12-28T15:53:16.567Z",
  "updatedAt": "2025-12-28T16:08:37.263Z"
}